#+TITLE: Comparison of GSat and the Skolemized version

#+OPTIONS: toc:nil 
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:ipython :exports both

In the following, we explore the statistics outputed by [[file:2021-04-26-14-37-10g-v0.5.1/][the experiments on GSat]] and on its [[file:2021-04-27-11-42-10g-v0.5.1][Skolemized version]]. The saturation times are in miliseconds in the columns ~GSAT_TIME~ and ~SK_TIME~ respectively. The columns ~NFTGD_NB~ and ~FTGD_NB~ respectively contain the number of non full and full TGDs in input. Each row contain the values of the execution on the ontology whose name is in column ~NAME~.

In the following, we remove the row, where:
- both algorithm executions reach the timeout
- and executions on the ontologies, which contains at least one non full TGD and one full TGD

The number of remaining ontologies is:
#+BEGIN_src ipython :session mysession :results output example
  import pandas as pd
  from tabulate import tabulate

  gsat_file='2021-04-26-14-37-10g-v0.5.1/stats.csv'
  sksat_file='2021-04-27-11-42-10g-v0.5.1/stats.csv'

  df_gsat = pd.read_csv(gsat_file, index_col='NAME').rename(columns={'TIME':'GSAT_TIME'})
  df_gsat = df_gsat[['NFTGD_NB', 'FTGD_NB', 'GSAT_TIME']]

  df_sksat = pd.read_csv(sksat_file, index_col='NAME').rename(columns={'TIME':'SK_TIME'})
  df_sksat = df_sksat['SK_TIME']

  df_interesting = pd.concat([df_gsat, df_sksat], axis=1)

  # selection of the execution where the input contains full and non full TDGs  
  df_interesting = df_interesting[ (df_interesting['NFTGD_NB'] > 0) & (df_interesting['FTGD_NB'] > 0)  ]

  # selection of the case where at least one algorithm does not reach the timeout
  df = df_interesting[ (df_interesting['GSAT_TIME'] != 'TIMEOUT') | (df_interesting['SK_TIME'] != 'TIMEOUT') ]

  print(len(df.index))
#+END_src

#+RESULTS:
: 367

The following table contains the rows where Gsat and the Skolemized executions reach the timeout sorted by the input size.
#+BEGIN_src ipython :session mysession :results output raw
    both_timeout = df_interesting[ (df_interesting['GSAT_TIME'] == 'TIMEOUT') & (df_interesting['SK_TIME'] == 'TIMEOUT') ]

    both_timeout = both_timeout.sort_values(by="NFTGD_NB").sort_values(by="FTGD_NB")

    print(tabulate(both_timeout, headers="keys", tablefmt='orgtbl'))
#+END_src

#+RESULTS:
| NAME | NFTGD_NB | FTGD_NB | GSAT_TIME | SK_TIME |
|------+----------+---------+-----------+---------|
|  706 |      342 |     520 | TIMEOUT   | TIMEOUT |
|  705 |      380 |     572 | TIMEOUT   | TIMEOUT |
|  704 |      355 |     616 | TIMEOUT   | TIMEOUT |
|  732 |      402 |     633 | TIMEOUT   | TIMEOUT |
|  713 |      455 |     683 | TIMEOUT   | TIMEOUT |
|  747 |      419 |     686 | TIMEOUT   | TIMEOUT |
|  719 |      488 |     713 | TIMEOUT   | TIMEOUT |
|  722 |      411 |     753 | TIMEOUT   | TIMEOUT |
|  755 |      459 |     756 | TIMEOUT   | TIMEOUT |
|  746 |      490 |     768 | TIMEOUT   | TIMEOUT |
|  715 |      567 |     785 | TIMEOUT   | TIMEOUT |
|  749 |      469 |     820 | TIMEOUT   | TIMEOUT |
|  756 |      578 |     950 | TIMEOUT   | TIMEOUT |
|  712 |      502 |     993 | TIMEOUT   | TIMEOUT |
|  716 |      640 |     995 | TIMEOUT   | TIMEOUT |
|  733 |      702 |    1086 | TIMEOUT   | TIMEOUT |
|  741 |      752 |    1225 | TIMEOUT   | TIMEOUT |
|  752 |      772 |    1309 | TIMEOUT   | TIMEOUT |
|  702 |      774 |    1321 | TIMEOUT   | TIMEOUT |
|  728 |      728 |    1357 | TIMEOUT   | TIMEOUT |
|  743 |      708 |    1486 | TIMEOUT   | TIMEOUT |
|  724 |      828 |    1517 | TIMEOUT   | TIMEOUT |
|  727 |      833 |    1567 | TIMEOUT   | TIMEOUT |
|  701 |      861 |    1589 | TIMEOUT   | TIMEOUT |
|  700 |     1053 |    1699 | TIMEOUT   | TIMEOUT |
|  703 |     1160 |    2004 | TIMEOUT   | TIMEOUT |
|    4 |    16705 |    2107 | TIMEOUT   | TIMEOUT |
|  350 |      934 |    3026 | TIMEOUT   | TIMEOUT |
|    5 |    16705 |    3211 | TIMEOUT   | TIMEOUT |
|    3 |    16709 |    3263 | TIMEOUT   | TIMEOUT |
|  174 |     1776 |    3626 | TIMEOUT   | TIMEOUT |
|   30 |     2096 |    3626 | TIMEOUT   | TIMEOUT |
|   31 |     2096 |    3626 | TIMEOUT   | TIMEOUT |
|   29 |     1776 |    4039 | TIMEOUT   | TIMEOUT |
|   32 |     2096 |    4039 | TIMEOUT   | TIMEOUT |
|  354 |     1417 |    4648 | TIMEOUT   | TIMEOUT |
|   39 |     2437 |    4826 | TIMEOUT   | TIMEOUT |
|  117 |     2437 |    4826 | TIMEOUT   | TIMEOUT |
|  518 |    11035 |    9363 | TIMEOUT   | TIMEOUT |
|   34 |    12339 |    9364 | TIMEOUT   | TIMEOUT |
|   37 |    12323 |    9445 | TIMEOUT   | TIMEOUT |
|   36 |    12329 |    9456 | TIMEOUT   | TIMEOUT |
|   38 |    12339 |    9457 | TIMEOUT   | TIMEOUT |
|   35 |    12339 |    9462 | TIMEOUT   | TIMEOUT |
|   33 |    12339 |    9462 | TIMEOUT   | TIMEOUT |
|  794 |     9484 |   10114 | TIMEOUT   | TIMEOUT |
|  463 |     9433 |   10339 | TIMEOUT   | TIMEOUT |
|  761 |     5598 |   13153 | TIMEOUT   | TIMEOUT |
|  462 |     9433 |   13435 | TIMEOUT   | TIMEOUT |
|  660 |     6673 |   13597 | TIMEOUT   | TIMEOUT |
|  658 |     9103 |   15170 | TIMEOUT   | TIMEOUT |
|  541 |     9119 |   27085 | TIMEOUT   | TIMEOUT |
|   26 |    23858 |   30697 | TIMEOUT   | TIMEOUT |
|   27 |    23858 |   31647 | TIMEOUT   | TIMEOUT |
|   28 |    23858 |   31647 | TIMEOUT   | TIMEOUT |
|  532 |    11943 |   38045 | TIMEOUT   | TIMEOUT |
|  391 |    11279 |   40960 | TIMEOUT   | TIMEOUT |
|  791 |     8665 |   41060 | TIMEOUT   | TIMEOUT |
|  792 |    27874 |   42592 | TIMEOUT   | TIMEOUT |
|  387 |    12025 |   44320 | TIMEOUT   | TIMEOUT |
|  426 |    24421 |   44891 | TIMEOUT   | TIMEOUT |
|  375 |    12632 |   45457 | TIMEOUT   | TIMEOUT |
|  488 |     7777 |   46967 | TIMEOUT   | TIMEOUT |
|  486 |     7777 |   46980 | TIMEOUT   | TIMEOUT |
|  382 |     8378 |   47281 | TIMEOUT   | TIMEOUT |
|  448 |    24847 |   49406 | TIMEOUT   | TIMEOUT |
|  682 |    24701 |   50011 | TIMEOUT   | TIMEOUT |
|  489 |     9507 |   52445 | TIMEOUT   | TIMEOUT |
|  285 |    66179 |   53294 | TIMEOUT   | TIMEOUT |
|  572 |    19594 |   57494 | TIMEOUT   | TIMEOUT |
|  378 |    21423 |   58205 | TIMEOUT   | TIMEOUT |
|  787 |    45442 |   59419 | TIMEOUT   | TIMEOUT |
|  395 |    21788 |   60146 | TIMEOUT   | TIMEOUT |
|  684 |    12683 |   62185 | TIMEOUT   | TIMEOUT |
|  795 |    47412 |   65393 | TIMEOUT   | TIMEOUT |
|  487 |    13015 |   65519 | TIMEOUT   | TIMEOUT |
|  383 |    13719 |   65847 | TIMEOUT   | TIMEOUT |
|   44 |    14319 |   67400 | TIMEOUT   | TIMEOUT |
|  764 |    14319 |   67400 | TIMEOUT   | TIMEOUT |
|  758 |    14319 |   67400 | TIMEOUT   | TIMEOUT |
|   41 |    14319 |   67437 | TIMEOUT   | TIMEOUT |
|   47 |    14431 |   67545 | TIMEOUT   | TIMEOUT |
|  675 |    25194 |   67697 | TIMEOUT   | TIMEOUT |
|   46 |    15352 |   69253 | TIMEOUT   | TIMEOUT |
|   48 |    14739 |   70580 | TIMEOUT   | TIMEOUT |
|   42 |    15417 |   71082 | TIMEOUT   | TIMEOUT |
|  470 |    44414 |   75146 | TIMEOUT   | TIMEOUT |
|  472 |    44414 |   75146 | TIMEOUT   | TIMEOUT |
|  471 |    42734 |   78977 | TIMEOUT   | TIMEOUT |
|  473 |    42734 |   78977 | TIMEOUT   | TIMEOUT |
|  437 |    44247 |   90904 | TIMEOUT   | TIMEOUT |
|   45 |    42412 |   98673 | TIMEOUT   | TIMEOUT |
|   40 |    43604 |  100787 | TIMEOUT   | TIMEOUT |
|  796 |    43604 |  100787 | TIMEOUT   | TIMEOUT |
|  778 |    42054 |  113189 | TIMEOUT   | TIMEOUT |
|  760 |    50814 |  170834 | TIMEOUT   | TIMEOUT |
|  797 |   225554 |  236447 | TIMEOUT   | TIMEOUT |


The following table contains the rows where Gsat executions reach the timeout and the Skolemized version ones are not, sorted by the input size.
#+BEGIN_src ipython :session mysession :results output raw
    gsat_timeout = df[ df['GSAT_TIME'] == 'TIMEOUT']

    gsat_timeout = gsat_timeout.sort_values(by="NFTGD_NB").sort_values(by="FTGD_NB")

    print(tabulate(gsat_timeout, headers="keys", tablefmt='orgtbl'))
#+END_src

#+RESULTS:
| NAME | NFTGD_NB | FTGD_NB | GSAT_TIME | SK_TIME |
|------+----------+---------+-----------+---------|
|  729 |       54 |     124 | TIMEOUT   |    2055 |
|  734 |       78 |     148 | TIMEOUT   |    2751 |
|  343 |        4 |     156 | TIMEOUT   |     292 |
|  718 |       97 |     182 | TIMEOUT   |    3354 |
|  709 |      130 |     211 | TIMEOUT   |   10881 |
|  708 |      125 |     215 | TIMEOUT   |   11688 |
|  731 |      148 |     252 | TIMEOUT   |   15534 |
|  511 |      346 |     282 | TIMEOUT   |    2539 |
|  714 |      193 |     298 | TIMEOUT   |   52442 |
|  738 |      159 |     301 | TIMEOUT   |   14762 |
|  742 |      191 |     312 | TIMEOUT   |   21866 |
|  753 |      207 |     337 | TIMEOUT   |   41001 |
|  775 |       52 |     341 | TIMEOUT   |  100047 |
|  721 |      222 |     347 | TIMEOUT   |   49395 |
|  737 |      227 |     350 | TIMEOUT   |   80269 |
|  710 |      240 |     356 | TIMEOUT   |  113635 |
|  720 |      190 |     364 | TIMEOUT   |   17380 |
|  723 |      225 |     369 | TIMEOUT   |   89836 |
|  751 |      248 |     391 | TIMEOUT   |   92301 |
|  748 |      223 |     398 | TIMEOUT   |   45935 |
|  739 |      234 |     412 | TIMEOUT   |   56705 |
|  707 |      257 |     412 | TIMEOUT   |  124991 |
|  783 |       12 |     415 | TIMEOUT   |   10630 |
|  750 |      209 |     416 | TIMEOUT   |   31908 |
|  319 |       12 |     417 | TIMEOUT   |    1456 |
|  344 |       12 |     417 | TIMEOUT   |    1112 |
|  345 |       12 |     417 | TIMEOUT   |    1376 |
|  782 |       12 |     417 | TIMEOUT   |    1173 |
|  781 |       12 |     417 | TIMEOUT   |    1350 |
|  711 |      245 |     421 | TIMEOUT   |   89838 |
|  744 |      228 |     430 | TIMEOUT   |   48279 |
|  735 |      290 |     455 | TIMEOUT   |  165308 |
|  740 |      289 |     477 | TIMEOUT   |  201831 |
|  745 |      329 |     528 | TIMEOUT   |  274939 |
|  479 |      317 |     566 | TIMEOUT   |  111957 |
|  726 |      283 |     571 | TIMEOUT   |   93339 |
|  480 |      320 |     677 | TIMEOUT   |  130160 |
|  282 |       65 |     883 | TIMEOUT   |    5742 |
|  283 |       85 |     967 | TIMEOUT   |    7859 |
|  624 |       98 |     980 | TIMEOUT   |     748 |
|   19 |       67 |    1078 | TIMEOUT   |    6651 |
|   18 |       84 |    1136 | TIMEOUT   |    9882 |
|   17 |       64 |    1177 | TIMEOUT   |    6390 |
|  284 |       81 |    1227 | TIMEOUT   |    7888 |
|   13 |       74 |    1265 | TIMEOUT   |    6746 |
|   20 |       80 |    1315 | TIMEOUT   |    6999 |
|  410 |      471 |    1339 | TIMEOUT   |  115935 |
|   24 |      130 |    1545 | TIMEOUT   |   14818 |
|   14 |      130 |    1545 | TIMEOUT   |   14208 |
|  788 |       10 |    2538 | TIMEOUT   |     526 |
|  425 |    11625 |   26750 | TIMEOUT   |  257156 |

The following table contains the rows where the Skolemized version executions reach the timeout and Gsat ones are not, sorted by the input size.
#+BEGIN_src ipython :session mysession :results output raw
    sksat_timeout = df[ df['SK_TIME'] == 'TIMEOUT']

    sksat_timeout = sksat_timeout.sort_values(by="NFTGD_NB").sort_values(by="FTGD_NB")
    print(tabulate(sksat_timeout, headers="keys", tablefmt='orgtbl'))
#+END_src

#+RESULTS:
| NAME | NFTGD_NB | FTGD_NB | GSAT_TIME | SK_TIME |
|------+----------+---------+-----------+---------|
|  422 |      420 |     672 |      3397 | TIMEOUT |
|  392 |      608 |    1213 |     10276 | TIMEOUT |
|  421 |      716 |    1271 |      7792 | TIMEOUT |
|  677 |     1607 |    1282 |      7062 | TIMEOUT |
|  376 |      694 |    1286 |      5196 | TIMEOUT |
|  424 |      728 |    1463 |      5270 | TIMEOUT |
|  579 |      728 |    1463 |      7530 | TIMEOUT |
|  393 |      776 |    1552 |     13575 | TIMEOUT |
|  676 |     1921 |    1662 |     11809 | TIMEOUT |
|  569 |      915 |    1701 |      7185 | TIMEOUT |
|  766 |      218 |    1845 |     13327 | TIMEOUT |
|  632 |      500 |    1895 |      4657 | TIMEOUT |
|  630 |      500 |    1931 |      4308 | TIMEOUT |
|  628 |      500 |    1931 |      3842 | TIMEOUT |
|  626 |      500 |    1931 |      3907 | TIMEOUT |
|  500 |     1621 |    1988 |     13235 | TIMEOUT |
|  666 |      269 |    2153 |     13466 | TIMEOUT |
|  633 |      572 |    2452 |      4822 | TIMEOUT |
|  631 |      572 |    2452 |      5554 | TIMEOUT |
|  657 |     1642 |    2580 |     16822 | TIMEOUT |
|  476 |     1834 |    2687 |      9783 | TIMEOUT |
|  595 |      219 |    2703 |     16325 | TIMEOUT |
|  597 |      223 |    2742 |     16860 | TIMEOUT |
|  397 |     1494 |    2922 |     14194 | TIMEOUT |
|  665 |      299 |    2975 |     16112 | TIMEOUT |
|  438 |     1512 |    3024 |     45565 | TIMEOUT |
|  353 |      221 |    3235 |     20750 | TIMEOUT |
|  352 |      221 |    3256 |     18372 | TIMEOUT |
|  419 |     1496 |    4468 |     57961 | TIMEOUT |
|  535 |     8479 |    4621 |     59860 | TIMEOUT |
|  420 |     1480 |    5169 |     16164 | TIMEOUT |
|  485 |     2593 |    5291 |     27002 | TIMEOUT |
|  380 |     3141 |    6000 |     22954 | TIMEOUT |
|  381 |     3216 |    6053 |     26549 | TIMEOUT |
|  762 |     2508 |    6634 |    292333 | TIMEOUT |
|  459 |     4013 |    6900 |     15713 | TIMEOUT |
|  477 |   156743 |   10606 |     ERROR | TIMEOUT |
|  680 |     7414 |   10873 |     37589 | TIMEOUT |
|  678 |     7557 |   11217 |     51247 | TIMEOUT |
|  540 |     1654 |   13265 |     19500 | TIMEOUT |
|  436 |     2308 |   24014 |    239183 | TIMEOUT |
|  390 |     7029 |   26439 |    251188 | TIMEOUT |
|  398 |     7419 |   27696 |     73192 | TIMEOUT |
|  371 |     7464 |   27758 |     75112 | TIMEOUT |
|  386 |     7559 |   28570 |     63751 | TIMEOUT |
|  400 |     7999 |   29907 |     82503 | TIMEOUT |
|  374 |     8270 |   30220 |    135841 | TIMEOUT |
|  394 |     9071 |   31193 |    150812 | TIMEOUT |
|  536 |     6762 |   36438 |     89188 | TIMEOUT |
|  415 |     7752 |   39986 |     73963 | TIMEOUT |
|  537 |    11089 |   51961 |    233116 | TIMEOUT |
|  416 |    12269 |   56650 |    243473 | TIMEOUT |
|  553 |    50566 |   90262 |     ERROR | TIMEOUT |
|  483 |    29022 |  114239 |     ERROR | TIMEOUT |

After fixing the issue about non-full rule definition, I have run [[file:sk_timeouts_after_fix/][again the skolemized version]] on the first ontologies of the table above and I obtained the following results :

| NAME | NFTGD_NB | FTGD_NB | GSAT_TIME | SK_TIME |
|------+----------+---------+-----------+---------|
|  422 |      420 |     672 |      3397 | 17610   |
|  392 |      608 |    1213 |     10276 | TIMEOUT |
|  421 |      716 |    1271 |      7792 | 295842  |
|  677 |     1607 |    1282 |      7062 | TIMEOUT |
|  376 |      694 |    1286 |      5196 | 25630   |
|  424 |      728 |    1463 |      5270 | 70002   |
|  579 |      728 |    1463 |      7530 | 72876   |
|  393 |      776 |    1552 |     13575 | TIMEOUT |

